src/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.Расходы</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтандартнаяУпаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/РеализацияТоваровУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СортироватьПоВозрастанию = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПриИзмененииЦеныИКоличествоТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПриИзмененииЦеныИКоличествоТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ПриИзмененииНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуВТЧТовары()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
	ТекущаяСтрока.Сумма = Сумма;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаксимальноеКоличествоТоваров()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Цена) И ЗначениеЗаполнено(ТекущаяСтрока.Сумма)Тогда
		ТекущаяСтрока.Количество = Окр(ТекущаяСтрока.Сумма/ТекущаяСтрока.Цена,0,РежимОкругления.Окр15как10);
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоСумме(Команда) 
	
	Если СортироватьПоВозрастанию Тогда
		Объект.Товары.Сортировать("Сумма Возр");
		СортироватьПоВозрастанию = Ложь; 
		Элементы.СортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаНаклоннаяВнизСерая;
	Иначе
		Объект.Товары.Сортировать("Сумма Убыв");
		СортироватьПоВозрастанию = Истина;
		Элементы.СортироватьПоСумме.Картинка = БиблиотекаКартинок.ОформлениеСтрелкаНаклоннаяВверхСерая;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Истина);
	СписокДействий.Вставить("ЗаполнитьЦену", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦеныИКоличествоТовары()
	
	СписокДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СписокДействий.Вставить("ЗаполнитьСумму", Истина);
	СписокДействий.Вставить("ЗаполнитьМаксимальноеКоличествоТоваров", Истина);
	
	ОбработатьСтрокуТЧ(СписокДействий);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуТЧ(СписокДействий)
	
	Если СписокДействий.ЗаполнитьСумму Тогда
		ЗаполнитьСуммуВТЧТовары();
	КонецЕсли;
	
	Если СписокДействий.ЗаполнитьМаксимальноеКоличествоТоваров Тогда
		ЗаполнитьМаксимальноеКоличествоТоваров();
	КонецЕсли;
	
	Если СписокДействий.ЗаполнитьСуммуПоСтавкеНДС Тогда
		ЗаполнитьСуммуПоСтавкеНДС();
	КонецЕсли;
	
	Если СписокДействий.ЗаполнитьЦену Тогда
		ЗаполнитьЦену();
	КонецЕсли;
	
	Если СписокДействий.ЗаполнитьСкидку Тогда
		ЗаполнитьСкидку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуПоСтавкеНДС()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекущаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(Элементы.Товары.ТекущиеДанные.Сумма, Элементы.Товары.ТекущиеДанные.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	СтруктураДействий = НовыйСписокДействийПриИзмененииТЧТовары();
	СтруктураДействий.Вставить("ЗаполнитьСкидку", Истина);
	
	ОбработатьСтрокуТЧ(СтруктураДействий);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦену()
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрока.Цена = ЦеныВызовСервера.РасчётЦены(ТекущаяСтрока.Сумма, ТекущаяСтрока.Количество);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСкидку()
	
	ИзмененнаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ИзмененнаяСтрока.Сумма = ЦеныВызовСервера.РасчётСуммы(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.Скидка);
	
КонецПроцедуры

&НаКлиенте
Функция НовыйСписокДействийПриИзмененииТЧТовары()
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ЗаполнитьСумму", Ложь);
	СтруктураДействий.Вставить("ЗаполнитьМаксимальноеКоличествоТоваров", Ложь);
	СтруктураДействий.Вставить("ЗаполнитьСуммуПоСтавкеНДС", Ложь);
	СтруктураДействий.Вставить("ЗаполнитьЦену", Ложь);
	
	Возврат СтруктураДействий;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ТекущиеДанные = Неопределено)
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	КонецЕсли;
	
	Номенклатура = ТекущиеДанные.Номенклатура;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Скидка = ЦеныВызовСервера.СкидкаНаДату(Номенклатура, ТекущаяДата());
		ТекущиеДанные.Скидка = Скидка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНоменклатурнуюГруппу(Номенклатура)
	
	Возврат Номенклатура.НоменклатурнаяГруппа;
	
КонецФункции

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
	
	ДополнительныеПараметры = Новый Структура;
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора", ПараметрыОткрытияФормы, Элементы.Товары);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Товары = Объект.Товары;
	
	Товары.Добавить().Номенклатура = ВыбранноеЗначение;
	
	ПоследняяСтрока = Товары.Получить(Товары.Количество()-1);
	
	ПриИзмененииНоменклатуры(ПоследняяСтрока);
	
КонецПроцедуры
